In [2]:
import numpy  as np
import pandas as pd

### Series

In [3]:
attempts = [1, 3, 2, 3, 2, 3, 1, 1, 2, 1]

In [4]:
attempts[0]

1

In [8]:
attempts[0:5]

[1, 3, 2, 3, 2]

In [11]:
attempts[-3:]

[1, 2, 1]

### DataFrames

In [12]:
exam_data = {'name': ['Anne', 'Kofi', 'Ridhwaan', 'Zara', 
'Muhammad', 'Donald', 'Isabella', 'Sarah', 'Paula', 'John'], 
'score': [12.5, 9, 16.5, None, 9, 20, 14.5, None, 8, 19], 
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 
'no', 'yes']} 

labels = ['Student ' + letter for letter in ['a', 'b', 'c', 'd', 
'e', 'f', 'g', 'h', 'i', 'j']]

In [14]:
exam = pd.DataFrame(exam_data)

In [18]:
exam.iloc[:2, :]

   name  score  attempts qualify
0  Anne   12.5         1     yes
1  Kofi    9.0         3      no

In [21]:
exam[["name", "score"]]

       name  score
0      Anne   12.5
1      Kofi    9.0
2  Ridhwaan   16.5
3      Zara    NaN
4  Muhammad    9.0
5    Donald   20.0
6  Isabella   14.5
7     Sarah    NaN
8     Paula    8.0
9      John   19.0

In [27]:
exam.loc[[1,3,4,8],["name", "score"]]

       name  score
1      Kofi    9.0
3      Zara    NaN
4  Muhammad    9.0
8     Paula    8.0

In [29]:
exam[exam['attempts'] > 2]

     name  score  attempts qualify
1    Kofi    9.0         3      no
3    Zara    NaN         3      no
5  Donald   20.0         3     yes

In [31]:
exam[exam['score'] >= 10]

       name  score  attempts qualify
0      Anne   12.5         1     yes
2  Ridhwaan   16.5         2     yes
5    Donald   20.0         3     yes
6  Isabella   14.5         1     yes
9      John   19.0         1     yes

In [41]:
exam[(exam['score'] > 15) & (exam['attempts'] == 1)]

   name  score  attempts qualify
9  John   19.0         1     yes

In [50]:
exam.index = labels
exam.loc["Student d", "name"]

'Zara'